using AttendanceTracking.View.Components;
using AttendanceTracking.View.Forms;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;
using Menu = AttendanceTracking.View.Forms.Menu;

namespace AttendanceTracking.View
{
    /// <summary>
    /// Interaction logic for MainWindow.xaml
    /// </summary>
    public partial class MainWindow : Window
    {
        public MainWindow()
        {
            InitializeComponent();
            var rand = new Random();
            var form = new AttendanceAccountingForm(
                "ПС-20Б",
                new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", "Захаров Алексей Дмитриевич", "Орлов Егор Владимирович", "Семенов Виктор Павлович", "Макаров Игорь Степанович", "Андреев Максим Викторович", "Лебедев Артем Алексеевич", "Архипов Даниил Сергеевич", "Степанов Григорий Антонович", "Кузнецов Роман Александрович", "Тимофеев Артур Дмитриевич", "Павлов Павел Олегович", "Жуков Николай Валерьевич", "Беляев Василий Васильевич", "Щербаков Валентин Степанович", "Григорьев Георгий Петрович", "Комаров Вячеслав Евгеньевич", "Прокофьев Федор Арсеньевич", "Власов Владислав Игнатьевич" },
                d => new MonthTable.Value[] { new MonthTable.Value(0, 8, 8, true) },
                e => MessageBox.Show($"({e.RowIndex},{e.Day}): {e.Hours} ->{e.IsExcused}")
            );
            form.Show();
            var formView = new MonthAttendanceViewForm(
                "ПС-20Б",
                new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", "Захаров Алексей Дмитриевич", "Орлов Егор Владимирович", "Семенов Виктор Павлович", "Макаров Игорь Степанович", "Андреев Максим Викторович", "Лебедев Артем Алексеевич", "Архипов Даниил Сергеевич", "Степанов Григорий Антонович", "Кузнецов Роман Александрович", "Тимофеев Артур Дмитриевич", "Павлов Павел Олегович", "Жуков Николай Валерьевич", "Беляев Василий Васильевич", "Щербаков Валентин Степанович", "Григорьев Георгий Петрович", "Комаров Вячеслав Евгеньевич", "Прокофьев Федор Арсеньевич", "Власов Владислав Игнатьевич" },
                d => new MonthTable.Value[] { new MonthTable.Value(0, 8, 8, true) }
            );
            formView.Show();
            var formLeader = new AppointmentLeaderForm(
                "ПС-20Б",
                (new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", "Захаров Алексей Дмитриевич", "Орлов Егор Владимирович", "Семенов Виктор Павлович", "Макаров Игорь Степанович", "Андреев Максим Викторович", "Лебедев Артем Алексеевич", "Архипов Даниил Сергеевич", "Степанов Григорий Антонович", "Кузнецов Роман Александрович", "Тимофеев Артур Дмитриевич", "Павлов Павел Олегович", "Жуков Николай Валерьевич", "Беляев Василий Васильевич", "Щербаков Валентин Степанович", "Григорьев Георгий Петрович", "Комаров Вячеслав Евгеньевич", "Прокофьев Федор Арсеньевич", "Власов Владислав Игнатьевич" })
                    .Select((s, i) => new AppointmentLeaderForm.Student(i, s)),
                5,
                id => MessageBox.Show($"Новый староста с id: {id}")
            );
            formLeader.Show();
            var formCurators = new AppointmentCuratorsForm(
                (new[] { "ПС-20Б", "БУ-20А", "ЭО-18А", "АТ-20Б", "ТМ-19А" })
                    .Select((g, i) => new AppointmentCuratorsForm.Group(i, rand.Next(0, 24), g)).ToArray(),
                (new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", "Захаров Алексей Дмитриевич", "Орлов Егор Владимирович", "Семенов Виктор Павлович", "Макаров Игорь Степанович", "Андреев Максим Викторович", "Лебедев Артем Алексеевич", "Архипов Даниил Сергеевич", "Степанов Григорий Антонович", "Кузнецов Роман Александрович", "Тимофеев Артур Дмитриевич", "Павлов Павел Олегович", "Жуков Николай Валерьевич", "Беляев Василий Васильевич", "Щербаков Валентин Степанович", "Григорьев Георгий Петрович", "Комаров Вячеслав Евгеньевич", "Прокофьев Федор Арсеньевич", "Власов Владислав Игнатьевич" })
                    .Select((c, i) => new AppointmentCuratorsForm.Propod(i, c)),
                (gi, ci) => MessageBox.Show($"Новый куратор группы {gi} с id: {ci}")
            );
            formCurators.Show();
            new AuthForm().Show();
            new Menu().Show();
            var attView = new AttendanceViewForm(
                "ПС-20Б",
                new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", "Захаров Алексей Дмитриевич", "Орлов Егор Владимирович", "Семенов Виктор Павлович", "Макаров Игорь Степанович", "Андреев Максим Викторович", "Лебедев Артем Алексеевич", "Архипов Даниил Сергеевич", "Степанов Григорий Антонович", "Кузнецов Роман Александрович", "Тимофеев Артур Дмитриевич", "Павлов Павел Олегович", "Жуков Николай Валерьевич", "Беляев Василий Васильевич", "Щербаков Валентин Степанович", "Григорьев Георгий Петрович", "Комаров Вячеслав Евгеньевич", "Прокофьев Федор Арсеньевич", "Власов Владислав Игнатьевич" },
                d => Enumerable.Range(0, 25).Select(n => new AditionMonthTable.Value(rand.Next(0, 3) == 0 ? rand.Next(1, 12) * 2 : 0, rand.Next(0, 9) == 0 ? rand.Next(1, 6) * 2 : 0)).ToArray()
            );
            attView.Show();
            var av = new AccountsViewForm(
                new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", }
                    .Select((a, i) => new AccountsViewForm.Account(new AccountsViewForm.People(i, a.Split(' ')[0], a.Split(' ')[1], a.Split(' ')[2], new string[] { "Role" }), "login" + i, "hash", rand.Next(0, 9) != 0)),
                a => MessageBox.Show($"Edit {a.Id} {a.FullName}"),
                a => MessageBox.Show($"Delete {a.Id} {a.FullName}"),
                a => { MessageBox.Show($"Create {a.Id} {a.FullName}"); return a; },
                () => new[] { "Иванов Иван Иванович", "Петров Петр Петрович", "Сидоров Александр Сергеевич", "Козлов Дмитрий Александрович", "Ильин Андрей Васильевич", "Морозов Сергей Николаевич", "Никитин Владимир Игоревич", "Захаров Алексей Дмитриевич", "Орлов Егор Владимирович", "Семенов Виктор Павлович", "Макаров Игорь Степанович", "Андреев Максим Викторович", "Лебедев Артем Алексеевич", "Архипов Даниил Сергеевич", "Степанов Григорий Антонович", "Кузнецов Роман Александрович", "Тимофеев Артур Дмитриевич", "Павлов Павел Олегович", "Жуков Николай Валерьевич", "Беляев Василий Васильевич", "Щербаков Валентин Степанович", "Григорьев Георгий Петрович", "Комаров Вячеслав Евгеньевич", "Прокофьев Федор Арсеньевич", "Власов Владислав Игнатьевич" }
                    .Select((p, i) => new AccountsViewForm.People(i, p.Split(' ')[0], p.Split(' ')[1], p.Split(' ')[2], new string[] { "Role" })
                ));
            av.Show();
        }
    }
}
